START_KEYBOARD = ["🏃 Начать"]
DONE_KEYBOARD = ["🏁 Завершить"]
BACK_KEYBOARD = ["⬅️ Назад"]
TO_TOP_KEYBOARD = ["🔙 В начало"]
CONFIRM_KEYBOARD = ["👍 Да", "👎 Нет"]
SEND_CONFIRMATION_KEYBOARD = [['📦 Отправить', '🚫 Отменить'], ]

GROUPS_REG_KEYBOARD = [["Дизайнер или аутсорсер"], ["Поставщик товаров"]]
REGISTRATION_KEYBOARD = ["Начать регистрацию"]
CANCEL_REG_KEYBOARD = ["🚫 Отменить регистрацию"]
CONTINUE_REG_KEYBOARD = ["➡️ Продолжить регистрацию"]
DONE_REG_KEYBOARD = ["✅ Подтвердить регистрацию"]

PROFILE_KEYBOARD = ["Мой профиль"]
DESIGNER_KEYBOARD = [
	["Реестр поставщиков", "Биржа услуг"],
	["События", "Барахолка"],
	["Личный помощник"],
]

SUPPLIER_KEYBOARD = [
	["Услуги"],
	["Заявки на сотрудничество"],
]

DESIGNER_PROFILE_KEYBOARD = [
	["Избранное", "Личные данные"],
	["Настройки"],
]

SUPPLIER_PROFILE_KEYBOARD = [
	["Личные данные", "Настройки"],
]

SUPPLIER_LIST_KEYBOARD = [
	["Показать еще", "Подбор поставщика"],
	BACK_KEYBOARD + TO_TOP_KEYBOARD,
]

SUPPLIER_DETAILS_KEYBOARD = [
	["Подбор поставщика"],
	["Выставить оценку", "Оставить отзыв"],
	BACK_KEYBOARD + TO_TOP_KEYBOARD,
]

QUESTIONNAIRE_KEYBOARD = [
    ["Продолжить", "Отменить"],
]
